zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl604x-pinctrl.h
/* gpio4_uart1_rts */
#define GPIO4_UART1_RTS \
	BFLB_PINMUX(4, uart1, rts, periph)

/* gpio4_uart1_cts */
#define GPIO4_UART1_CTS \
	BFLB_PINMUX(4, uart1, cts, periph)

/* gpio4_uart1_tx */
#define GPIO4_UART1_TX \
	BFLB_PINMUX(4, uart1, tx, periph)

/* gpio4_uart1_rx */
#define GPIO4_UART1_RX \
	BFLB_PINMUX(4, uart1, rx, periph)

/* gpio4_pwm_ch4 */
#define GPIO4_PWM_CH4 \
	BFLB_PINMUX(4, pwm, ch4, periph)

/* gpio4_fem_gpio0 */
#define GPIO4_FEM_GPIO0 \
	BFLB_PINMUX(4, fem, gpio0, periph)

/* gpio4_jtag_tms */
#define GPIO4_JTAG_TMS \
	BFLB_PINMUX(4, jtag, tms, periph)

/* gpio4_adc_ch1 */
#define GPIO4_ADC_CH1 \
	BFLB_PINMUX(4, adc, ch1, analog)

/* gpio5_spi_miso */
#define GPIO5_SPI_MISO \
	BFLB_PINMUX(5, spi, miso, periph)

/* gpio5_i2c_sda */
#define GPIO5_I2C_SDA \
	BFLB_PINMUX(5, i2c, sda, periph)

/* gpio5_uart0_rts */
#define GPIO5_UART0_RTS \
	BFLB_PINMUX(5, uart0, rts, periph)

/* gpio5_uart0_cts */
#define GPIO5_UART0_CTS \
	BFLB_PINMUX(5, uart0, cts, periph)

/* gpio5_uart0_tx */
#define GPIO5_UART0_TX \
	BFLB_PINMUX(5, uart0, tx, periph)

/* gpio5_uart0_rx */
#define GPIO5_UART0_RX \
	BFLB_PINMUX(5, uart0, rx, periph)

/* gpio5_uart1_rts */
#define GPIO5_UART1_RTS \
	BFLB_PINMUX(5, uart1, rts, periph)

/* gpio5_uart1_cts */
#define GPIO5_UART1_CTS \
	BFLB_PINMUX(5, uart1, cts, periph)

/* gpio5_uart1_tx */
#define GPIO5_UART1_TX \
	BFLB_PINMUX(5, uart1, tx, periph)

/* gpio5_uart1_rx */
#define GPIO5_UART1_RX \
	BFLB_PINMUX(5, uart1, rx, periph)

/* gpio5_pwm_ch0 */
#define GPIO5_PWM_CH0 \
	BFLB_PINMUX(5, pwm, ch0, periph)

/* gpio5_fem_gpio1 */
#define GPIO5_FEM_GPIO1 \
	BFLB_PINMUX(5, fem, gpio1, periph)

/* gpio5_jtag_tdi */
#define GPIO5_JTAG_TDI \
	BFLB_PINMUX(5, jtag, tdi, periph)

/* gpio5_adc_ch4 */
#define GPIO5_ADC_CH4 \
	BFLB_PINMUX(5, adc, ch4, analog)

/* gpio6_spi_ss */
#define GPIO6_SPI_SS \
	BFLB_PINMUX(6, spi, ss, periph)

/* gpio6_i2c_scl */
#define GPIO6_I2C_SCL \
	BFLB_PINMUX(6, i2c, scl, periph)

/* gpio6_uart0_rts */
#define GPIO6_UART0_RTS \
	BFLB_PINMUX(6, uart0, rts, periph)

/* gpio6_uart0_cts */
#define GPIO6_UART0_CTS \
	BFLB_PINMUX(6, uart0, cts, periph)

/* gpio6_uart0_tx */
#define GPIO6_UART0_TX \
	BFLB_PINMUX(6, uart0, tx, periph)

/* gpio6_uart0_rx */
#define GPIO6_UART0_RX \
	BFLB_PINMUX(6, uart0, rx, periph)

/* gpio6_uart1_rts */
#define GPIO6_UART1_RTS \
	BFLB_PINMUX(6, uart1, rts, periph)

/* gpio6_uart1_cts */
#define GPIO6_UART1_CTS \
	BFLB_PINMUX(6, uart1, cts, periph)

/* gpio6_uart1_tx */
#define GPIO6_UART1_TX \
	BFLB_PINMUX(6, uart1, tx, periph)

/* gpio6_uart1_rx */
#define GPIO6_UART1_RX \
	BFLB_PINMUX(6, uart1, rx, periph)

/* gpio6_pwm_ch1 */
#define GPIO6_PWM_CH1 \
	BFLB_PINMUX(6, pwm, ch1, periph)

/* gpio6_fem_gpio2 */
#define GPIO6_FEM_GPIO2 \
	BFLB_PINMUX(6, fem, gpio2, periph)

/* gpio6_jtag_tck */
#define GPIO6_JTAG_TCK \
	BFLB_PINMUX(6, jtag, tck, periph)

/* gpio6_adc_ch5 */
#define GPIO6_ADC_CH5 \
	BFLB_PINMUX(6, adc, ch5, analog)

/* gpio7_spi_sck */
#define GPIO7_SPI_SCK \
	BFLB_PINMUX(7, spi, sck, periph)

/* gpio7_i2c_sda */
#define GPIO7_I2C_SDA \
	BFLB_PINMUX(7, i2c, sda, periph)

/* gpio7_uart0_rts */
#define GPIO7_UART0_RTS \
	BFLB_PINMUX(7, uart0, rts, periph)

/* gpio7_uart0_cts */
#define GPIO7_UART0_CTS \
	BFLB_PINMUX(7, uart0, cts, periph)

/* gpio7_uart0_tx */
#define GPIO7_UART0_TX \
	BFLB_PINMUX(7, uart0, tx, periph)

/* gpio7_uart0_rx */
#define GPIO7_UART0_RX \
	BFLB_PINMUX(7, uart0, rx, periph)

/* gpio7_uart1_rts */
#define GPIO7_UART1_RTS \
	BFLB_PINMUX(7, uart1, rts, periph)

/* gpio7_uart1_cts */
#define GPIO7_UART1_CTS \
	BFLB_PINMUX(7, uart1, cts, periph)

/* gpio7_uart1_tx */
#define GPIO7_UART1_TX \
	BFLB_PINMUX(7, uart1, tx, periph)

/* gpio7_uart1_rx */
#define GPIO7_UART1_RX \
	BFLB_PINMUX(7, uart1, rx, periph)

/* gpio7_pwm_ch2 */
#define GPIO7_PWM_CH2 \
	BFLB_PINMUX(7, pwm, ch2, periph)

/* gpio7_fem_gpio3 */
#define GPIO7_FEM_GPIO3 \
	BFLB_PINMUX(7, fem, gpio3, periph)

/* gpio7_jtag_tdo */
#define GPIO7_JTAG_TDO \
	BFLB_PINMUX(7, jtag, tdo, periph)

/* gpio8_spi_mosi */
#define GPIO8_SPI_MOSI \
	BFLB_PINMUX(8, spi, mosi, periph)

/* gpio8_i2c_scl */
#define GPIO8_I2C_SCL \
	BFLB_PINMUX(8, i2c, scl, periph)

/* gpio8_uart0_rts */
#define GPIO8_UART0_RTS \
	BFLB_PINMUX(8, uart0, rts, periph)

/* gpio8_uart0_cts */
#define GPIO8_UART0_CTS \
	BFLB_PINMUX(8, uart0, cts, periph)

/* gpio8_uart0_tx */
#define GPIO8_UART0_TX \
	BFLB_PINMUX(8, uart0, tx, periph)

/* gpio8_uart0_rx */
#define GPIO8_UART0_RX \
	BFLB_PINMUX(8, uart0, rx, periph)

/* gpio8_uart1_rts */
#define GPIO8_UART1_RTS \
	BFLB_PINMUX(8, uart1, rts, periph)

/* gpio8_uart1_cts */
#define GPIO8_UART1_CTS \
	BFLB_PINMUX(8, uart1, cts, periph)

/* gpio8_uart1_tx */
#define GPIO8_UART1_TX \
	BFLB_PINMUX(8, uart1, tx, periph)

/* gpio8_uart1_rx */
#define GPIO8_UART1_RX \
	BFLB_PINMUX(8, uart1, rx, periph)

/* gpio8_pwm_ch3 */
#define GPIO8_PWM_CH3 \
	BFLB_PINMUX(8, pwm, ch3, periph)

/* gpio8_fem_gpio0 */
#define GPIO8_FEM_GPIO0 \
	BFLB_PINMUX(8, fem, gpio0, periph)

/* gpio8_jtag_tms */
#define GPIO8_JTAG_TMS \
	BFLB_PINMUX(8, jtag, tms, periph)

/* gpio9_spi_miso */
#define GPIO9_SPI_MISO \
	BFLB_PINMUX(9, spi, miso, periph)

/* gpio9_i2c_sda */
#define GPIO9_I2C_SDA \
	BFLB_PINMUX(9, i2c, sda, periph)

/* gpio9_uart0_rts */
#define GPIO9_UART0_RTS \
	BFLB_PINMUX(9, uart0, rts, periph)

/* gpio9_uart0_cts */
#define GPIO9_UART0_CTS \
	BFLB_PINMUX(9, uart0, cts, periph)

/* gpio9_uart0_tx */
#define GPIO9_UART0_TX \
	BFLB_PINMUX(9, uart0, tx, periph)

/* gpio9_uart0_rx */
#define GPIO9_UART0_RX \
	BFLB_PINMUX(9, uart0, rx, periph)

/* gpio9_uart1_rts */
#define GPIO9_UART1_RTS \
	BFLB_PINMUX(9, uart1, rts, periph)

/* gpio9_uart1_cts */
#define GPIO9_UART1_CTS \
	BFLB_PINMUX(9, uart1, cts, periph)

/* gpio9_uart1_tx */
#define GPIO9_UART1_TX \
	BFLB_PINMUX(9, uart1, tx, periph)

/* gpio9_uart1_rx */
#define GPIO9_UART1_RX \
	BFLB_PINMUX(9, uart1, rx, periph)

/* gpio9_pwm_ch4 */
#define GPIO9_PWM_CH4 \
	BFLB_PINMUX(9, pwm, ch4, periph)

/* gpio9_fem_gpio1 */
#define GPIO9_FEM_GPIO1 \
	BFLB_PINMUX(9, fem, gpio1, periph)

/* gpio9_jtag_tdi */
#define GPIO9_JTAG_TDI \
	BFLB_PINMUX(9, jtag, tdi, periph)

/* gpio9_adc_ch6 */
#define GPIO9_ADC_CH6 \
	BFLB_PINMUX(9, adc, ch6, analog)

/* gpio10_spi_ss */
#define GPIO10_SPI_SS \
	BFLB_PINMUX(10, spi, ss, periph)

