zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl604x-pinctrl.h
/* gpio10_i2c_scl */
#define GPIO10_I2C_SCL \
	BFLB_PINMUX(10, i2c, scl, periph)

/* gpio10_uart0_rts */
#define GPIO10_UART0_RTS \
	BFLB_PINMUX(10, uart0, rts, periph)

/* gpio10_uart0_cts */
#define GPIO10_UART0_CTS \
	BFLB_PINMUX(10, uart0, cts, periph)

/* gpio10_uart0_tx */
#define GPIO10_UART0_TX \
	BFLB_PINMUX(10, uart0, tx, periph)

/* gpio10_uart0_rx */
#define GPIO10_UART0_RX \
	BFLB_PINMUX(10, uart0, rx, periph)

/* gpio10_uart1_rts */
#define GPIO10_UART1_RTS \
	BFLB_PINMUX(10, uart1, rts, periph)

/* gpio10_uart1_cts */
#define GPIO10_UART1_CTS \
	BFLB_PINMUX(10, uart1, cts, periph)

/* gpio10_uart1_tx */
#define GPIO10_UART1_TX \
	BFLB_PINMUX(10, uart1, tx, periph)

/* gpio10_uart1_rx */
#define GPIO10_UART1_RX \
	BFLB_PINMUX(10, uart1, rx, periph)

/* gpio10_pwm_ch0 */
#define GPIO10_PWM_CH0 \
	BFLB_PINMUX(10, pwm, ch0, periph)

/* gpio10_fem_gpio2 */
#define GPIO10_FEM_GPIO2 \
	BFLB_PINMUX(10, fem, gpio2, periph)

/* gpio10_jtag_tck */
#define GPIO10_JTAG_TCK \
	BFLB_PINMUX(10, jtag, tck, periph)

/* gpio10_mic_bias */
#define GPIO10_MIC_BIAS \
	BFLB_PINMUX(10, mic, bias, analog)

/* gpio10_adc_ch8 */
#define GPIO10_ADC_CH8 \
	BFLB_PINMUX(10, adc, ch8, analog)

/* gpio11_spi_sclk */
#define GPIO11_SPI_SCLK \
	BFLB_PINMUX(11, spi, sclk, periph)

/* gpio11_i2c_sda */
#define GPIO11_I2C_SDA \
	BFLB_PINMUX(11, i2c, sda, periph)

/* gpio11_uart0_rts */
#define GPIO11_UART0_RTS \
	BFLB_PINMUX(11, uart0, rts, periph)

/* gpio11_uart0_cts */
#define GPIO11_UART0_CTS \
	BFLB_PINMUX(11, uart0, cts, periph)

/* gpio11_uart0_tx */
#define GPIO11_UART0_TX \
	BFLB_PINMUX(11, uart0, tx, periph)

/* gpio11_uart0_rx */
#define GPIO11_UART0_RX \
	BFLB_PINMUX(11, uart0, rx, periph)

/* gpio11_uart1_rts */
#define GPIO11_UART1_RTS \
	BFLB_PINMUX(11, uart1, rts, periph)

/* gpio11_uart1_cts */
#define GPIO11_UART1_CTS \
	BFLB_PINMUX(11, uart1, cts, periph)

/* gpio11_uart1_tx */
#define GPIO11_UART1_TX \
	BFLB_PINMUX(11, uart1, tx, periph)

/* gpio11_uart1_rx */
#define GPIO11_UART1_RX \
	BFLB_PINMUX(11, uart1, rx, periph)

/* gpio11_pwm_ch1 */
#define GPIO11_PWM_CH1 \
	BFLB_PINMUX(11, pwm, ch1, periph)

/* gpio11_fem_gpio3 */
#define GPIO11_FEM_GPIO3 \
	BFLB_PINMUX(11, fem, gpio3, periph)

/* gpio11_jtag_tdo */
#define GPIO11_JTAG_TDO \
	BFLB_PINMUX(11, jtag, tdo, periph)

/* gpio11_adc_ch10 */
#define GPIO11_ADC_CH10 \
	BFLB_PINMUX(11, adc, ch10, analog)

/* gpio11_ir_tx */
#define GPIO11_IR_TX \
	BFLB_PINMUX(11, ir, tx, analog)

/* gpio11_ir_rx */
#define GPIO11_IR_RX \
	BFLB_PINMUX(11, ir, rx, input)

/* gpio12_spi_mosi */
#define GPIO12_SPI_MOSI \
	BFLB_PINMUX(12, spi, mosi, periph)

/* gpio12_i2c_scl */
#define GPIO12_I2C_SCL \
	BFLB_PINMUX(12, i2c, scl, periph)

/* gpio12_uart0_rts */
#define GPIO12_UART0_RTS \
	BFLB_PINMUX(12, uart0, rts, periph)

/* gpio12_uart0_cts */
#define GPIO12_UART0_CTS \
	BFLB_PINMUX(12, uart0, cts, periph)

/* gpio12_uart0_tx */
#define GPIO12_UART0_TX \
	BFLB_PINMUX(12, uart0, tx, periph)

/* gpio12_uart0_rx */
#define GPIO12_UART0_RX \
	BFLB_PINMUX(12, uart0, rx, periph)

/* gpio12_uart1_rts */
#define GPIO12_UART1_RTS \
	BFLB_PINMUX(12, uart1, rts, periph)

/* gpio12_uart1_cts */
#define GPIO12_UART1_CTS \
	BFLB_PINMUX(12, uart1, cts, periph)

/* gpio12_uart1_tx */
#define GPIO12_UART1_TX \
	BFLB_PINMUX(12, uart1, tx, periph)

/* gpio12_uart1_rx */
#define GPIO12_UART1_RX \
	BFLB_PINMUX(12, uart1, rx, periph)

/* gpio12_pwm_ch2 */
#define GPIO12_PWM_CH2 \
	BFLB_PINMUX(12, pwm, ch2, periph)

/* gpio12_fem_gpio0 */
#define GPIO12_FEM_GPIO0 \
	BFLB_PINMUX(12, fem, gpio0, periph)

/* gpio12_jtag_tms */
#define GPIO12_JTAG_TMS \
	BFLB_PINMUX(12, jtag, tms, periph)

/* gpio12_adc_ch0 */
#define GPIO12_ADC_CH0 \
	BFLB_PINMUX(12, adc, ch0, analog)

/* gpio12_ir_rx */
#define GPIO12_IR_RX \
	BFLB_PINMUX(12, ir, rx, input)

/* gpio13_spi_miso */
#define GPIO13_SPI_MISO \
	BFLB_PINMUX(13, spi, miso, periph)

/* gpio13_i2c_sda */
#define GPIO13_I2C_SDA \
	BFLB_PINMUX(13, i2c, sda, periph)

/* gpio13_uart0_rts */
#define GPIO13_UART0_RTS \
	BFLB_PINMUX(13, uart0, rts, periph)

/* gpio13_uart0_cts */
#define GPIO13_UART0_CTS \
	BFLB_PINMUX(13, uart0, cts, periph)

/* gpio13_uart0_tx */
#define GPIO13_UART0_TX \
	BFLB_PINMUX(13, uart0, tx, periph)

/* gpio13_uart0_rx */
#define GPIO13_UART0_RX \
	BFLB_PINMUX(13, uart0, rx, periph)

/* gpio13_uart1_rts */
#define GPIO13_UART1_RTS \
	BFLB_PINMUX(13, uart1, rts, periph)

/* gpio13_uart1_cts */
#define GPIO13_UART1_CTS \
	BFLB_PINMUX(13, uart1, cts, periph)

/* gpio13_uart1_tx */
#define GPIO13_UART1_TX \
	BFLB_PINMUX(13, uart1, tx, periph)

/* gpio13_uart1_rx */
#define GPIO13_UART1_RX \
	BFLB_PINMUX(13, uart1, rx, periph)

/* gpio13_pwm_ch3 */
#define GPIO13_PWM_CH3 \
	BFLB_PINMUX(13, pwm, ch3, periph)

/* gpio13_fem_gpio1 */
#define GPIO13_FEM_GPIO1 \
	BFLB_PINMUX(13, fem, gpio1, periph)

/* gpio13_jtag_tdi */
#define GPIO13_JTAG_TDI \
	BFLB_PINMUX(13, jtag, tdi, periph)

/* gpio13_adc_ch3 */
#define GPIO13_ADC_CH3 \
	BFLB_PINMUX(13, adc, ch3, analog)

/* gpio13_dac_cha */
#define GPIO13_DAC_CHA \
	BFLB_PINMUX(13, dac, cha, analog)

/* gpio13_ir_rx */
#define GPIO13_IR_RX \
	BFLB_PINMUX(13, ir, rx, input)

/* gpio14_spi_ss */
#define GPIO14_SPI_SS \
	BFLB_PINMUX(14, spi, ss, periph)

/* gpio14_i2c_scl */
#define GPIO14_I2C_SCL \
	BFLB_PINMUX(14, i2c, scl, periph)

/* gpio14_uart0_rts */
#define GPIO14_UART0_RTS \
	BFLB_PINMUX(14, uart0, rts, periph)

/* gpio14_uart0_cts */
#define GPIO14_UART0_CTS \
	BFLB_PINMUX(14, uart0, cts, periph)

/* gpio14_uart0_tx */
#define GPIO14_UART0_TX \
	BFLB_PINMUX(14, uart0, tx, periph)

/* gpio14_uart0_rx */
#define GPIO14_UART0_RX \
	BFLB_PINMUX(14, uart0, rx, periph)

/* gpio14_uart1_rts */
#define GPIO14_UART1_RTS \
	BFLB_PINMUX(14, uart1, rts, periph)

/* gpio14_uart1_cts */
#define GPIO14_UART1_CTS \
	BFLB_PINMUX(14, uart1, cts, periph)

/* gpio14_uart1_tx */
#define GPIO14_UART1_TX \
	BFLB_PINMUX(14, uart1, tx, periph)

/* gpio14_uart1_rx */
#define GPIO14_UART1_RX \
	BFLB_PINMUX(14, uart1, rx, periph)

