zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl604x-pinctrl.h
/* gpio14_pwm_ch4 */
#define GPIO14_PWM_CH4 \
	BFLB_PINMUX(14, pwm, ch4, periph)

/* gpio14_fem_gpio1 */
#define GPIO14_FEM_GPIO1 \
	BFLB_PINMUX(14, fem, gpio1, periph)

/* gpio14_jtag_tck */
#define GPIO14_JTAG_TCK \
	BFLB_PINMUX(14, jtag, tck, periph)

/* gpio14_adc_ch2 */
#define GPIO14_ADC_CH2 \
	BFLB_PINMUX(14, adc, ch2, analog)

/* gpio14_dac_chb */
#define GPIO14_DAC_CHB \
	BFLB_PINMUX(14, dac, chb, analog)

/* gpio15_spi_sclk */
#define GPIO15_SPI_SCLK \
	BFLB_PINMUX(15, spi, sclk, periph)

/* gpio15_i2c_sda */
#define GPIO15_I2C_SDA \
	BFLB_PINMUX(15, i2c, sda, periph)

/* gpio15_uart0_rts */
#define GPIO15_UART0_RTS \
	BFLB_PINMUX(15, uart0, rts, periph)

/* gpio15_uart0_cts */
#define GPIO15_UART0_CTS \
	BFLB_PINMUX(15, uart0, cts, periph)

/* gpio15_uart0_tx */
#define GPIO15_UART0_TX \
	BFLB_PINMUX(15, uart0, tx, periph)

/* gpio15_uart0_rx */
#define GPIO15_UART0_RX \
	BFLB_PINMUX(15, uart0, rx, periph)

/* gpio15_uart1_rts */
#define GPIO15_UART1_RTS \
	BFLB_PINMUX(15, uart1, rts, periph)

/* gpio15_uart1_cts */
#define GPIO15_UART1_CTS \
	BFLB_PINMUX(15, uart1, cts, periph)

/* gpio15_uart1_tx */
#define GPIO15_UART1_TX \
	BFLB_PINMUX(15, uart1, tx, periph)

/* gpio15_uart1_rx */
#define GPIO15_UART1_RX \
	BFLB_PINMUX(15, uart1, rx, periph)

/* gpio15_pwm_ch0 */
#define GPIO15_PWM_CH0 \
	BFLB_PINMUX(15, pwm, ch0, periph)

/* gpio15_fem_gpio3 */
#define GPIO15_FEM_GPIO3 \
	BFLB_PINMUX(15, fem, gpio3, periph)

/* gpio15_jtag_tdo */
#define GPIO15_JTAG_TDO \
	BFLB_PINMUX(15, jtag, tdo, periph)

/* gpio15_adc_ch11 */
#define GPIO15_ADC_CH11 \
	BFLB_PINMUX(15, adc, ch11, analog)

/* gpio16_spi_mosi */
#define GPIO16_SPI_MOSI \
	BFLB_PINMUX(16, spi, mosi, periph)

/* gpio16_i2c_scl */
#define GPIO16_I2C_SCL \
	BFLB_PINMUX(16, i2c, scl, periph)

/* gpio16_uart0_rts */
#define GPIO16_UART0_RTS \
	BFLB_PINMUX(16, uart0, rts, periph)

/* gpio16_uart0_cts */
#define GPIO16_UART0_CTS \
	BFLB_PINMUX(16, uart0, cts, periph)

/* gpio16_uart0_tx */
#define GPIO16_UART0_TX \
	BFLB_PINMUX(16, uart0, tx, periph)

/* gpio16_uart0_rx */
#define GPIO16_UART0_RX \
	BFLB_PINMUX(16, uart0, rx, periph)

/* gpio16_uart1_rts */
#define GPIO16_UART1_RTS \
	BFLB_PINMUX(16, uart1, rts, periph)

/* gpio16_uart1_cts */
#define GPIO16_UART1_CTS \
	BFLB_PINMUX(16, uart1, cts, periph)

/* gpio16_uart1_tx */
#define GPIO16_UART1_TX \
	BFLB_PINMUX(16, uart1, tx, periph)

/* gpio16_uart1_rx */
#define GPIO16_UART1_RX \
	BFLB_PINMUX(16, uart1, rx, periph)

/* gpio16_pwm_ch1 */
#define GPIO16_PWM_CH1 \
	BFLB_PINMUX(16, pwm, ch1, periph)

/* gpio16_fem_gpio0 */
#define GPIO16_FEM_GPIO0 \
	BFLB_PINMUX(16, fem, gpio0, periph)

/* gpio16_jtag_tms */
#define GPIO16_JTAG_TMS \
	BFLB_PINMUX(16, jtag, tms, periph)

/* gpio17_sf2_d3 */
#define GPIO17_SF2_D3 \
	BFLB_PINMUX(17, sf2, d3, periph)

/* gpio17_spi_miso */
#define GPIO17_SPI_MISO \
	BFLB_PINMUX(17, spi, miso, periph)

/* gpio17_i2c_sda */
#define GPIO17_I2C_SDA \
	BFLB_PINMUX(17, i2c, sda, periph)

/* gpio17_uart0_rts */
#define GPIO17_UART0_RTS \
	BFLB_PINMUX(17, uart0, rts, periph)

/* gpio17_uart0_cts */
#define GPIO17_UART0_CTS \
	BFLB_PINMUX(17, uart0, cts, periph)

/* gpio17_uart0_tx */
#define GPIO17_UART0_TX \
	BFLB_PINMUX(17, uart0, tx, periph)

/* gpio17_uart0_rx */
#define GPIO17_UART0_RX \
	BFLB_PINMUX(17, uart0, rx, periph)

/* gpio17_uart1_rts */
#define GPIO17_UART1_RTS \
	BFLB_PINMUX(17, uart1, rts, periph)

/* gpio17_uart1_cts */
#define GPIO17_UART1_CTS \
	BFLB_PINMUX(17, uart1, cts, periph)

/* gpio17_uart1_tx */
#define GPIO17_UART1_TX \
	BFLB_PINMUX(17, uart1, tx, periph)

/* gpio17_uart1_rx */
#define GPIO17_UART1_RX \
	BFLB_PINMUX(17, uart1, rx, periph)

/* gpio17_pwm_ch2 */
#define GPIO17_PWM_CH2 \
	BFLB_PINMUX(17, pwm, ch2, periph)

/* gpio17_fem_gpio1 */
#define GPIO17_FEM_GPIO1 \
	BFLB_PINMUX(17, fem, gpio1, periph)

/* gpio17_jtag_tdi */
#define GPIO17_JTAG_TDI \
	BFLB_PINMUX(17, jtag, tdi, periph)

/* gpio18_sf2_d2 */
#define GPIO18_SF2_D2 \
	BFLB_PINMUX(18, sf2, d2, periph)

/* gpio18_spi_ss */
#define GPIO18_SPI_SS \
	BFLB_PINMUX(18, spi, ss, periph)

/* gpio18_i2c_scl */
#define GPIO18_I2C_SCL \
	BFLB_PINMUX(18, i2c, scl, periph)

/* gpio18_uart0_rts */
#define GPIO18_UART0_RTS \
	BFLB_PINMUX(18, uart0, rts, periph)

/* gpio18_uart0_cts */
#define GPIO18_UART0_CTS \
	BFLB_PINMUX(18, uart0, cts, periph)

/* gpio18_uart0_tx */
#define GPIO18_UART0_TX \
	BFLB_PINMUX(18, uart0, tx, periph)

/* gpio18_uart0_rx */
#define GPIO18_UART0_RX \
	BFLB_PINMUX(18, uart0, rx, periph)

/* gpio18_uart1_rts */
#define GPIO18_UART1_RTS \
	BFLB_PINMUX(18, uart1, rts, periph)

/* gpio18_uart1_cts */
#define GPIO18_UART1_CTS \
	BFLB_PINMUX(18, uart1, cts, periph)

/* gpio18_uart1_tx */
#define GPIO18_UART1_TX \
	BFLB_PINMUX(18, uart1, tx, periph)

/* gpio18_uart1_rx */
#define GPIO18_UART1_RX \
	BFLB_PINMUX(18, uart1, rx, periph)

/* gpio18_pwm_ch3 */
#define GPIO18_PWM_CH3 \
	BFLB_PINMUX(18, pwm, ch3, periph)

/* gpio18_fem_gpio2 */
#define GPIO18_FEM_GPIO2 \
	BFLB_PINMUX(18, fem, gpio2, periph)

/* gpio18_jtag_tck */
#define GPIO18_JTAG_TCK \
	BFLB_PINMUX(18, jtag, tck, periph)

/* gpio19_sf2_d1 */
#define GPIO19_SF2_D1 \
	BFLB_PINMUX(19, sf2, d1, periph)

/* gpio19_spi_sclk */
#define GPIO19_SPI_SCLK \
	BFLB_PINMUX(19, spi, sclk, periph)

/* gpio19_i2c_sda */
#define GPIO19_I2C_SDA \
	BFLB_PINMUX(19, i2c, sda, periph)

/* gpio19_uart0_rts */
#define GPIO19_UART0_RTS \
	BFLB_PINMUX(19, uart0, rts, periph)

/* gpio19_uart0_cts */
#define GPIO19_UART0_CTS \
	BFLB_PINMUX(19, uart0, cts, periph)

/* gpio19_uart0_tx */
#define GPIO19_UART0_TX \
	BFLB_PINMUX(19, uart0, tx, periph)

/* gpio19_uart0_rx */
#define GPIO19_UART0_RX \
	BFLB_PINMUX(19, uart0, rx, periph)

/* gpio19_uart1_rts */
#define GPIO19_UART1_RTS \
	BFLB_PINMUX(19, uart1, rts, periph)

/* gpio19_uart1_cts */
#define GPIO19_UART1_CTS \
	BFLB_PINMUX(19, uart1, cts, periph)

/* gpio19_uart1_tx */
#define GPIO19_UART1_TX \
	BFLB_PINMUX(19, uart1, tx, periph)

/* gpio19_uart1_rx */
#define GPIO19_UART1_RX \
	BFLB_PINMUX(19, uart1, rx, periph)

/* gpio19_pwm_ch4 */
#define GPIO19_PWM_CH4 \
	BFLB_PINMUX(19, pwm, ch4, periph)

/* gpio19_fem_gpio3 */
#define GPIO19_FEM_GPIO3 \
	BFLB_PINMUX(19, fem, gpio3, periph)

/* gpio19_jtag_tdo */
#define GPIO19_JTAG_TDO \
	BFLB_PINMUX(19, jtag, tdo, periph)

/* gpio20_sf2_d0 */
#define GPIO20_SF2_D0 \
	BFLB_PINMUX(20, sf2, d0, periph)

/* gpio20_sf3_d0 */
#define GPIO20_SF3_D0 \
	BFLB_PINMUX(20, sf3, d0, periph)

/* gpio20_spi_mosi */
#define GPIO20_SPI_MOSI \
	BFLB_PINMUX(20, spi, mosi, periph)

/* gpio20_i2c_scl */
#define GPIO20_I2C_SCL \
	BFLB_PINMUX(20, i2c, scl, periph)

/* gpio20_uart0_rts */
#define GPIO20_UART0_RTS \
	BFLB_PINMUX(20, uart0, rts, periph)

/* gpio20_uart0_cts */
#define GPIO20_UART0_CTS \
	BFLB_PINMUX(20, uart0, cts, periph)

