zephyrproject-rtos/hal_bouffalolab/include/zephyr/dt-bindings/pinctrl/bl604x-pinctrl.h
/* gpio20_uart0_tx */
#define GPIO20_UART0_TX \
	BFLB_PINMUX(20, uart0, tx, periph)

/* gpio20_uart0_rx */
#define GPIO20_UART0_RX \
	BFLB_PINMUX(20, uart0, rx, periph)

/* gpio20_uart1_rts */
#define GPIO20_UART1_RTS \
	BFLB_PINMUX(20, uart1, rts, periph)

/* gpio20_uart1_cts */
#define GPIO20_UART1_CTS \
	BFLB_PINMUX(20, uart1, cts, periph)

/* gpio20_uart1_tx */
#define GPIO20_UART1_TX \
	BFLB_PINMUX(20, uart1, tx, periph)

/* gpio20_uart1_rx */
#define GPIO20_UART1_RX \
	BFLB_PINMUX(20, uart1, rx, periph)

/* gpio20_pwm_ch0 */
#define GPIO20_PWM_CH0 \
	BFLB_PINMUX(20, pwm, ch0, periph)

/* gpio20_fem_gpio0 */
#define GPIO20_FEM_GPIO0 \
	BFLB_PINMUX(20, fem, gpio0, periph)

/* gpio20_jtag_tms */
#define GPIO20_JTAG_TMS \
	BFLB_PINMUX(20, jtag, tms, periph)

/* gpio21_sf2_cs */
#define GPIO21_SF2_CS \
	BFLB_PINMUX(21, sf2, cs, periph)

/* gpio21_sf3_cs */
#define GPIO21_SF3_CS \
	BFLB_PINMUX(21, sf3, cs, periph)

/* gpio21_spi_miso */
#define GPIO21_SPI_MISO \
	BFLB_PINMUX(21, spi, miso, periph)

/* gpio21_i2c_sda */
#define GPIO21_I2C_SDA \
	BFLB_PINMUX(21, i2c, sda, periph)

/* gpio21_uart0_rts */
#define GPIO21_UART0_RTS \
	BFLB_PINMUX(21, uart0, rts, periph)

/* gpio21_uart0_cts */
#define GPIO21_UART0_CTS \
	BFLB_PINMUX(21, uart0, cts, periph)

/* gpio21_uart0_tx */
#define GPIO21_UART0_TX \
	BFLB_PINMUX(21, uart0, tx, periph)

/* gpio21_uart0_rx */
#define GPIO21_UART0_RX \
	BFLB_PINMUX(21, uart0, rx, periph)

/* gpio21_uart1_rts */
#define GPIO21_UART1_RTS \
	BFLB_PINMUX(21, uart1, rts, periph)

/* gpio21_uart1_cts */
#define GPIO21_UART1_CTS \
	BFLB_PINMUX(21, uart1, cts, periph)

/* gpio21_uart1_tx */
#define GPIO21_UART1_TX \
	BFLB_PINMUX(21, uart1, tx, periph)

/* gpio21_uart1_rx */
#define GPIO21_UART1_RX \
	BFLB_PINMUX(21, uart1, rx, periph)

/* gpio21_pwm_ch1 */
#define GPIO21_PWM_CH1 \
	BFLB_PINMUX(21, pwm, ch1, periph)

/* gpio21_fem_gpio1 */
#define GPIO21_FEM_GPIO1 \
	BFLB_PINMUX(21, fem, gpio1, periph)

/* gpio21_jtag_tdi */
#define GPIO21_JTAG_TDI \
	BFLB_PINMUX(21, jtag, tdi, periph)

/* gpio22_sf2_clk */
#define GPIO22_SF2_CLK \
	BFLB_PINMUX(22, sf2, clk, periph)

/* gpio22_sf3_clk */
#define GPIO22_SF3_CLK \
	BFLB_PINMUX(22, sf3, clk, periph)

/* gpio22_spi_ss */
#define GPIO22_SPI_SS \
	BFLB_PINMUX(22, spi, ss, periph)

/* gpio22_i2c_scl */
#define GPIO22_I2C_SCL \
	BFLB_PINMUX(22, i2c, scl, periph)

/* gpio22_uart0_rts */
#define GPIO22_UART0_RTS \
	BFLB_PINMUX(22, uart0, rts, periph)

/* gpio22_uart0_cts */
#define GPIO22_UART0_CTS \
	BFLB_PINMUX(22, uart0, cts, periph)

/* gpio22_uart0_tx */
#define GPIO22_UART0_TX \
	BFLB_PINMUX(22, uart0, tx, periph)

/* gpio22_uart0_rx */
#define GPIO22_UART0_RX \
	BFLB_PINMUX(22, uart0, rx, periph)

/* gpio22_uart1_rts */
#define GPIO22_UART1_RTS \
	BFLB_PINMUX(22, uart1, rts, periph)

/* gpio22_uart1_cts */
#define GPIO22_UART1_CTS \
	BFLB_PINMUX(22, uart1, cts, periph)

/* gpio22_uart1_tx */
#define GPIO22_UART1_TX \
	BFLB_PINMUX(22, uart1, tx, periph)

/* gpio22_uart1_rx */
#define GPIO22_UART1_RX \
	BFLB_PINMUX(22, uart1, rx, periph)

/* gpio22_pwm_ch2 */
#define GPIO22_PWM_CH2 \
	BFLB_PINMUX(22, pwm, ch2, periph)

/* gpio22_fem_gpio2 */
#define GPIO22_FEM_GPIO2 \
	BFLB_PINMUX(22, fem, gpio2, periph)

/* gpio22_jtag_tck */
#define GPIO22_JTAG_TCK \
	BFLB_PINMUX(22, jtag, tck, periph)

#endif /* DT_BINDINGS_PINCTRL_BFLB_BL604X_PINCTRL_H_ */
